In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
dataset=pd.read_csv('daily_csv.csv')
dataset

            Date  Price
0     1997-01-07   3.82
1     1997-01-08   3.80
2     1997-01-09   3.61
3     1997-01-10   3.92
4     1997-01-13   4.00
...          ...    ...
5913  2020-07-08   1.78
5914  2020-07-09   1.88
5915  2020-07-10   1.79
5916  2020-07-13   1.75
5917  2020-07-14   1.74

[5918 rows x 2 columns]

In [3]:
dataset.isnull().any()

Date     False
Price     True
dtype: bool

In [4]:
new = dataset["Date"].str.split("-", n = 1, expand = True)
dataset["year"]= new[0]
dataset["month"]= new[1]
dataset

            Date  Price  year  month
0     1997-01-07   3.82  1997  01-07
1     1997-01-08   3.80  1997  01-08
2     1997-01-09   3.61  1997  01-09
3     1997-01-10   3.92  1997  01-10
4     1997-01-13   4.00  1997  01-13
...          ...    ...   ...    ...
5913  2020-07-08   1.78  2020  07-08
5914  2020-07-09   1.88  2020  07-09
5915  2020-07-10   1.79  2020  07-10
5916  2020-07-13   1.75  2020  07-13
5917  2020-07-14   1.74  2020  07-14

[5918 rows x 4 columns]

In [5]:
cols=['Date']
dataset= dataset.drop(cols,axis=1)

In [6]:
dataset

      Price  year  month
0      3.82  1997  01-07
1      3.80  1997  01-08
2      3.61  1997  01-09
3      3.92  1997  01-10
4      4.00  1997  01-13
...     ...   ...    ...
5913   1.78  2020  07-08
5914   1.88  2020  07-09
5915   1.79  2020  07-10
5916   1.75  2020  07-13
5917   1.74  2020  07-14

[5918 rows x 3 columns]

In [7]:
new = dataset["month"].str.split("-", n = 1, expand = True)

In [8]:
dataset["Month"]= new[0]

In [9]:
dataset["Day"]= new[1]

In [10]:
dataset

      Price  year  month Month Day
0      3.82  1997  01-07    01  07
1      3.80  1997  01-08    01  08
2      3.61  1997  01-09    01  09
3      3.92  1997  01-10    01  10
4      4.00  1997  01-13    01  13
...     ...   ...    ...   ...  ..
5913   1.78  2020  07-08    07  08
5914   1.88  2020  07-09    07  09
5915   1.79  2020  07-10    07  10
5916   1.75  2020  07-13    07  13
5917   1.74  2020  07-14    07  14

[5918 rows x 5 columns]

In [11]:
cols=['month']
dataset= dataset.drop(cols,axis=1)

In [12]:
dataset['Price'].fillna((dataset['Price'].mean()),inplace=True)

In [13]:
dataset

      Price  year Month Day
0      3.82  1997    01  07
1      3.80  1997    01  08
2      3.61  1997    01  09
3      3.92  1997    01  10
4      4.00  1997    01  13
...     ...   ...   ...  ..
5913   1.78  2020    07  08
5914   1.88  2020    07  09
5915   1.79  2020    07  10
5916   1.75  2020    07  13
5917   1.74  2020    07  14

[5918 rows x 4 columns]

In [14]:
dataset.isnull().any()

Price    False
year     False
Month    False
Day      False
dtype: bool

In [15]:
x=dataset.iloc[:,1:4].values
x

array([['1997', '01', '07'],
       ['1997', '01', '08'],
       ['1997', '01', '09'],
       ...,
       ['2020', '07', '10'],
       ['2020', '07', '13'],
       ['2020', '07', '14']], dtype=object)

In [16]:
y=dataset.iloc[:,:1].values
y

array([[3.82],
       [3.8 ],
       [3.61],
       ...,
       [1.79],
       [1.75],
       [1.74]])

In [17]:
from sklearn.model_selection import train_test_split

In [18]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [31]:
from sklearn.tree import DecisionTreeRegressor
Rf=DecisionTreeRegressor(random_state=0,criterion="mae")

In [32]:
Rf.fit(x_train,y_train)

DecisionTreeRegressor(ccp_alpha=0.0, criterion='mae', max_depth=None,
                      max_features=None, max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, presort='deprecated',
                      random_state=0, splitter='best')

In [33]:
y_predict=Rf.predict(x_test)

In [34]:
y_test

array([[3.01],
       [4.53],
       [7.04],
       ...,
       [2.28],
       [3.09],
       [8.1 ]])

In [35]:
from sklearn.metrics import r2_score

In [36]:
r2_score(y_test,y_predict)

0.9869770129020592